РазработкаОУМобильная/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>НДС18</name>
    <comment>(Общ) Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
    <comment>(Общ) Расчетная ставка НДС 18% / 118%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>(Общ) Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
    <comment>(Общ) Расчетная ставка НДС 10% / 110%</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>(Общ) Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>(Общ) Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
    <comment>(Общ) Расчетная ставка НДС 20% / 120%</comment>
  </enumValues>
</mdclass:Enum>

РазработкаОУМобильная/src/CommonModules/ЦенообразованиеКлиентСерверПовтИсп/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает числовое значение ставки НДС по значению перечисления
//
// Параметры:
// 		СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - значение перечисления СтавкиНДС.
//
// Возвращаемое значение:
// 		Число - Значение ставки НДС числом.
//
Функция ПолучитьСтавкуНДСЧислом(Знач СтавкаНДС) Экспорт
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
		Возврат 0.1;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18") Тогда
		Возврат 0.18;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Возвращает числовое значение ставки НДС по значению перечисления
//
// Параметры:
// 		СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - значение перечисления СтавкиНДС.
//
// Возвращаемое значение:
// 		Число - Значение ставки НДС числом.
//
Функция ПолучитьСтавкуНДСЦелымЧислом(Знач СтавкаНДС) Экспорт
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
		Возврат 10;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18") Тогда
		Возврат 18;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

// Возвращает значение перечисления ставки НДС по числовому значению
//
//  Параметры:
//  Число - Значение ставки НДС числом.
//
//  Возвращаемое значение:
//  СтавкаНДС - ПеречислениеСсылка.СтавкиНДС - значение перечисления СтавкиНДС.
//
Функция ПолучитьСтавкуНДС(Знач СтавкаНДСЧислом, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Если СтавкаНДСЧислом = 18 Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18");
	ИначеЕсли СтавкаНДСЧислом = 10 Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10");
	ИначеЕсли СтавкаНДСЧислом = 0 Тогда
		Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	Иначе
		Если ЗначениеПоУмолчанию = Неопределено Тогда
			Возврат ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18");
		Иначе
			Возврат ЗначениеПоУмолчанию;
		КонецЕсли;
	КонецЕсли;
КонецФункции

#КонецОбласти
